; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v10 ?v6)
             (pred_8 ?v2 ?v7)
             (pred_1 ?v10 ?v7)
             (pred_12 ?v3 ?v10 )
	     (pred_4 ?v10)
             (pred_3 ?v8)
             (pred_5 ?v2)
             (pred_2 ?v7)
             (pred_9 ?v10)
             (pred_11 ?v2)
             (pred_7 ?v10)
             (pred_10 ))



(:action op_4
:parameters (?v4 ?v12 ?v11 ?v1)
:precondition (and (pred_3 ?v4) (pred_3 ?v12) (pred_5 ?v11) (pred_2 ?v1)
          (pred_6 ?v4 ?v12) (pred_8 ?v11 ?v1)
                   (pred_1 ?v12 ?v1) (pred_4 ?v4) 
                   (pred_9 ?v12) (pred_11 ?v11))
:effect (and  (pred_7 ?v12) (not (pred_9 ?v12))))


(:action op_3
:parameters (?v4 ?v9)
:precondition (and (pred_3 ?v4) (pred_3 ?v9)
               (pred_4 ?v4) (pred_6 ?v4 ?v9) (pred_7 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v4))))

(:action op_2
:parameters (?v4 ?v11)
:precondition (and (pred_3 ?v4) (pred_5 ?v11) 
                  (pred_4 ?v4) (pred_12 ?v11 ?v4) (pred_10 ))
:effect (and (pred_11 ?v11)
   (not (pred_12 ?v11 ?v4)) (not (pred_10 ))))


(:action op_1
:parameters (?v4 ?v5 ?v13)
:precondition (and (pred_3 ?v4) (pred_5 ?v5) (pred_5 ?v13)
                  (pred_4 ?v4) (pred_11 ?v13) (pred_12 ?v5 ?v4))
:effect (and (pred_11 ?v5) (pred_12 ?v13 ?v4)
        (not (pred_11 ?v13)) (not (pred_12 ?v5 ?v4))))

(:action op_5
:parameters (?v4 ?v11)
:precondition (and (pred_3 ?v4) (pred_5 ?v11) 
                  (pred_4 ?v4) (pred_11 ?v11))
:effect (and (pred_10 ) (pred_12 ?v11 ?v4) (not (pred_11 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_01 obj_20 obj_07 obj_11 obj_14 obj_19 obj_12 obj_13 obj_10 obj_04 obj_03 obj_18 obj_15 obj_02 obj_21
    obj_09 obj_16
    obj_05 obj_08 obj_17
    )

    (:init
       (pred_10)

       (pred_3 obj_06)
       (pred_3 obj_01)
       (pred_3 obj_20)
       (pred_3 obj_07)
       (pred_3 obj_11)
       (pred_3 obj_14)
       (pred_3 obj_19)
       (pred_3 obj_12)
       (pred_3 obj_13)
       (pred_3 obj_10)
       (pred_3 obj_04)
       (pred_3 obj_03)
       (pred_3 obj_18)
       (pred_3 obj_15)
       (pred_3 obj_02)
       (pred_3 obj_21)
       (pred_2 obj_09)
       (pred_2 obj_16)
       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_17)

       (pred_6 obj_06 obj_11)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_01 obj_20)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_20 obj_01)
       (pred_6 obj_07 obj_12)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_14)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_14 obj_10)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_19 obj_04)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_12 obj_03)
       (pred_6 obj_12 obj_07)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_13 obj_18)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_10 obj_15)
       (pred_6 obj_10 obj_04)
       (pred_6 obj_10 obj_14)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_04 obj_02)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_19)
       (pred_6 obj_04 obj_10)
       (pred_6 obj_03 obj_21)
       (pred_6 obj_03 obj_12)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_18 obj_13)
       (pred_6 obj_15 obj_02)
       (pred_6 obj_15 obj_10)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_02 obj_04)
       (pred_6 obj_02 obj_15)
       (pred_6 obj_21 obj_03)
       (pred_6 obj_21 obj_02)
       (pred_9 obj_15)
       (pred_9 obj_13)
       (pred_9 obj_19)
       (pred_1  obj_15 obj_09)
       (pred_1  obj_13 obj_16)
       (pred_1  obj_19 obj_16)
       (pred_7 obj_06)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_07)
       (pred_7 obj_11)
       (pred_7 obj_14)
       (pred_7 obj_12)
       (pred_7 obj_10)
       (pred_7 obj_04)
       (pred_7 obj_03)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_21)

       (pred_8  obj_05 obj_09)
       (pred_8  obj_08 obj_16)
       (pred_8  obj_17 obj_09)
       (pred_12 obj_05 obj_12)
       (pred_12 obj_08 obj_11)
       (pred_12 obj_17 obj_07)
       (pred_4 obj_01)
    )

    (:goal (and
       (pred_12 obj_05 obj_02)
       (pred_12 obj_08 obj_03)
    ))
(:constraints
  (always (not (pred_4 obj_04)))
)
)

; plan
1. (op_3 obj_01 obj_06)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_06)
   goals met: 0 of 2
2. (op_3 obj_06 obj_11)
   deleted: (pred_4 obj_06)
   added: (pred_4 obj_11)
   goals met: 0 of 2
3. (op_2 obj_11 obj_08)
   deleted: (pred_12 obj_08 obj_11) (pred_10)
   added: (pred_11 obj_08)
   goals met: 0 of 2
4. (op_3 obj_11 obj_14)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_14)
   goals met: 0 of 2
5. (op_4 obj_14 obj_19 obj_08 obj_16)
   deleted: (pred_9 obj_19)
   added: (pred_7 obj_19)
   goals met: 0 of 2
6. (op_3 obj_14 obj_19)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_19)
   goals met: 0 of 2
7. (op_3 obj_19 obj_12)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_12)
   goals met: 0 of 2
8. (op_3 obj_12 obj_03)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_03)
   goals met: 0 of 2
9. (op_5 obj_03 obj_08)
   deleted: (pred_11 obj_08)
   added: (pred_10) (pred_12 obj_08 obj_03)
   goals met: 1 of 2
10. (op_3 obj_03 obj_12)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_12)
   goals met: 1 of 2
11. (op_2 obj_12 obj_05)
   deleted: (pred_12 obj_05 obj_12) (pred_10)
   added: (pred_11 obj_05)
   goals met: 1 of 2
12. (op_3 obj_12 obj_03)
   deleted: (pred_4 obj_12)
   added: (pred_4 obj_03)
   goals met: 1 of 2
13. (op_3 obj_03 obj_21)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_21)
   goals met: 1 of 2
14. (op_3 obj_21 obj_02)
   deleted: (pred_4 obj_21)
   added: (pred_4 obj_02)
   goals met: 1 of 2
15. (op_5 obj_02 obj_05)
   deleted: (pred_11 obj_05)
   added: (pred_10) (pred_12 obj_05 obj_02)
   goals met: 2 of 2
